# 과제 3

#4번
score = int(input("점수를 입력하세요 : "))
if score >= 90 :
    print("장학생" , end = ' ')
elif score >= 60 :
    print("합격" , end = ' ')
else :
    print("불합격" , end = ' ')
print("입니다. ^^")


#5번
num = 5
res = "짝수" if num % 2 == 0 else "홀수"
print(res)

#5번 답 : 3번

#6번
#6-1
nn = [100, 200, 300, 400, 500]
nn[1] = 777
print(nn)

#6-1 답 : [100, 777, 300, 400, 500]

#6-2
nn = [100, 200, 300, 400, 500]
nn[1] = [444,555]
print(nn)

#6-2 답 : [100, [444, 555], 300, 400, 500]

#6-3
nn = [100, 200, 300, 400, 500]
nn[1:4] = [444,555]
print(nn)

#6-3 답 : [100, 444, 555, 500]

#6-4
nn = [100, 200, 300, 400, 500]
nn[2:] = []
print(nn)

#6-4 답 : [100, 200]
